### Capturing NAN values with a new feature

It works well if the data are not missing completely at random

In [13]:
import pandas as pd
import numpy as np

In [14]:
df=pd.read_csv('titanic_train.csv', usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [15]:
df['Age_NAN'] = np.where(df['Age'].isnull(),1,0)

In [16]:
df.head(100)

    Survived   Age     Fare  Age_NAN
0          0  22.0   7.2500        0
1          1  38.0  71.2833        0
2          1  26.0   7.9250        0
3          1  35.0  53.1000        0
4          0  35.0   8.0500        0
..       ...   ...      ...      ...
95         0   NaN   8.0500        1
96         0  71.0  34.6542        0
97         1  23.0  63.3583        0
98         1  34.0  23.0000        0
99         0  34.0  26.0000        0

[100 rows x 4 columns]

In [17]:
#we can replace the nan values in age with median of 'Age'

In [18]:
median = df.Age.median()
median

28.0

In [19]:
df['Age'].fillna( df.Age.median(), inplace = True)

In [20]:
df.head(10)

   Survived   Age     Fare  Age_NAN
0         0  22.0   7.2500        0
1         1  38.0  71.2833        0
2         1  26.0   7.9250        0
3         1  35.0  53.1000        0
4         0  35.0   8.0500        0
5         0  28.0   8.4583        1
6         0  54.0  51.8625        0
7         0   2.0  21.0750        0
8         1  27.0  11.1333        0
9         1  14.0  30.0708        0

#### Advantages

1. Easy to implement
2. Captures the importance of missing values

#### Disadvantages

1. Creating Additional Features(Curse of Dimensionality)